আইনশৃঙ্খলা বাহিনীর ওপর শাহবাগীদের সন্ত্রাসী হামলার স্পষ্ট ফুটেজ। 

এই উগ্র বাম শাহবাগীরা ড. ইউনুসের বাসভবন অভিমুখে যেতে চাইলে স্বাভাবিক ভাবেই সরকার প্রধানের নিরাপত্তার স্বার্থে নিয়োজিত পুলিশ তাদের বাঁধা দেয়। কিন্তু তারা বিনা উস্কানিতে পুলিশের ওপর হামলা চালিয়ে এক পুলিশ কর্মকর্তার গায়ের কাপড় ছিঁড়ে ফেলে। এসময় পারস্পরিক ধাক্কাধাক্কি হলে বেশ কয়েকজন আহত হয়। যা নিয়ে প্রথম আলো ও ডেইলি স্টারসহ শাহবাগপন্থী মিডিয়াগুলোর উদ্দেশ্যপ্রণোদিত ছবি সম্প্রচার এবং শাহবাগীদের পূর্ব থেকেই এমন অপরাজনীতি করার যে অপপ্রয়াস সেটা তারা করছে অনলাইনে।
